package com.chenjun.oop;
//封装---高内聚（类的内部数据操作细节自己完成），低耦合（仅暴露少量的方法给外部使用）
/*
1.提高程序的安全性，保护数据
2.隐藏代码的实现细节
3.统一接口
4.系统的可维护性提高了
 */
public class Demo封装小结 {

}
/*
    1.类与对象
        类是一个模板：抽象，对象是一个具体实例
    2.方法
        定义、调用
    3.对应的引用
        引用类型：基本类型（8）
        对象是通过引用来操作的：栈---->堆
    4.属性：字段Field成员变量
        默认初始化：
        数字：0   0.0
         char： u0000
         boolea：false
         引用： null
         修饰符  属性类型  属性名 = 属性值！

     5.对象的创建和使用
         -必须使用new关键字创造对象  ，构造器 Person  chenjun = new Person（）；
         -对象的属性  chenjun.name
         -对象的方法  chenjun.sleep（）

      6.类：
        静态的属性----属性
        动态的行为----方法

        封装、继承、多态

     */
